export default {
    //  地图索引
    index: 13,
    //  角色进入地图后的位置，[从下层上来后的位置， 从上层下来后的位置]
    heroPostion: [111, 119],
    //  上楼的楼梯位置，上楼后的楼层
    upStair: [120, 14],
    //  下楼的楼梯位置，下楼后的楼层
    downStair: [110, 12],
    //  加载所有墙，直接输入地图坐标
    walls: [99, 100, 101, 102, 103, 105, 106, 108, 107, 109, 70, 59, 48, 37, 26, 36, 47, 58, 27, 28, 39, 50, 61, 72, 40, 51, 62],
    //  加载血墙
    bloods: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 29, 30, 31, 32, 33, 34, 35, 41, 42, 43, 44, 45, 46, 49, 52, 53, 54, 55, 56, 57, 60, 63, 64, 65, 66, 67, 68, 69, 71, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98],
    //  怪物，怪物名称，怪物坐标，第三个值可有可无，用来开门的。
    monsters: [

    ],
    //  物品，key，位置，物品数值
    items: [
        ['shenshengjian', 38, 100, 'attack']
    ],
    //  门，key，位置
    gates: [
        ['yellowGate', 104]
    ],
    //  npc，key，位置，事件类别（根据楼层分类），第几事件
    npc: [

    ],
    events: [

    ]
}